tap "anomalyco/tap"
tap "appergb/openless", "https://github.com/Open-Less/openless.git", trusted: { casks: ["openless"] }
tap "aviator-co/tap"
tap "d12frosted/emacs-plus"
tap "dlvhdr/formulae"
tap "docker/tap"
tap "ejoffe/tap"
tap "eugene1g/safehouse"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "kakoune-lsp/kakoune-lsp"
tap "manaflow-ai/cmux"
tap "nanobot-ai/tap"
tap "nikitabobko/tap"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Code searching, linting, rewriting
brew "ast-grep"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Cross-platform make
brew "cmake"
# Diff that understands syntax
brew "difftastic"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# High-level command-line interface for Git
brew "git-town"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Utility for directing compilation
brew "make"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Open Fortinet client for PPP+TLS VPN tunnel services
brew "openfortivpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Terminal slideshow tool
brew "presenterm"
# Rsync for cloud storage
brew "rclone"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Terminal client for .http/.rest files with HTTP, GraphQL, and gRPC support
brew "resterm"
# SVG rendering tool and library
brew "resvg"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Safe, concurrent, practical language
brew "rust"
# Interactive find and replace in the terminal
brew "scooter"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Convert HTML to PDF
brew "weasyprint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
brew "aviator-co/tap/av", trusted: true
# macOS sandbox wrapper for coding agents
brew "eugene1g/safehouse/agent-safehouse", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Anthropic's official Claude AI desktop app
cask "claude"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# GNU Emacs text editor with patches for macOS
cask "d12frosted/emacs-plus/emacs-plus-app", trusted: true
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-adwaita-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-atkynson-mono-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-google-sans-code"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# GPU-based terminal emulator
cask "kitty"
# Input method for Bopomofo (Phonetic Symbols of Mandarin Chinese)
cask "mcbopomofo"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# Build, run, and govern agents across the software development lifecycle
cask "docker/tap/sbx", trusted: true
# Rime input method engine
cask "squirrel-app"
# Menu bar manager
cask "thaw"
# Open-source markdown editor
cask "zettlr"
go "cmd/go"
go "cmd/gofmt"
go "github.com/wailsapp/wails/v2/cmd/wails"
cargo "kak-tree-sitter"
cargo "ktsctl"
uv "cli-agent-orchestrator"
uv "zmk"
npm "@earendil-works/pi-coding-agent"
npm "@playwright/cli"
npm "agent-browser"
npm "corepack"
